In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (3.12.0)
Requirement already satisfied: ipython in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (8.22.2)
Requirement already satisfied: sqlalchemy>=2.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (2.0.36)
Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: decorator in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (2.17.2)
Requirement already satisfied: stack-data in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.14.2)
Requirement already satisfied: pexpect>4.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [2]:
import prettytable

# PrettyTable için varsayılan stil tanımlaması
prettytable.DEFAULT = prettytable.__dict__.get("MSWORD_FRIENDLY", prettytable.DEFAULT)

/var/folders/5f/h_sq9qfs1593m5tqmzlkhynm0000gn/T/ipykernel_17885/1198897394.py:4: DeprecationWarning: the 'DEFAULT' constant is deprecated, use the 'TableStyle' enum instead
  prettytable.DEFAULT = prettytable.__dict__.get("MSWORD_FRIENDLY", prettytable.DEFAULT)

In [3]:
%%!
pip install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (0.5.0)',
 'Requirement already satisfied: prettytable in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (3.12.0)',
 'Requirement already satisfied: ipython in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (8.22.2)',
 'Requirement already satisfied: sqlalchemy>=2.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (2.0.36)',
 'Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.4.4)',
 'Requirement already satisfied: six in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython-sql) (1.16.0)',
 'Requirement already satisfied: ipython-genutils in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)',
 'Requirement already satisfied: decorator in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.1.1)',
 'Requirement already satisfied: jedi>=0.16 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.19.1)',
 'Requirement already satisfied: matplotlib-inline in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.1.6)',
 'Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (3.0.43)',
 'Requirement already satisfied: pygments>=2.4.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (2.17.2)',
 'Requirement already satisfied: stack-data in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (0.6.3)',
 'Requirement already satisfied: traitlets>=5.13.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (5.14.2)',
 'Requirement already satisfied: pexpect>4.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from ipython->ipython-sql) (4.9.0)',
 'Requirement already satisfied: wcwidth in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from prettytable->ipython-sql) (0.2.13)',
 'Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)',
 'Requirement already satisfied: ptyprocess>=0.5 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)',
 'Requirement already satisfied: executing>=1.2.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)',
 'Requirement already satisfied: asttokens>=2.1.0 in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)',
 'Requirement already satisfied: pure-eval in /Users/mehmetsenel/Library/Python/3.11/lib/python/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)']

In [4]:
%load_ext sql

In [5]:
%reload_ext sql

In [6]:
%sql sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db

In [7]:
%%sql
SELECT * FROM Customers LIMIT 3 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]

In [8]:
%%sql
CREATE TABLE yeni_tablo(firstname varchar(20),
                        lastname varchar(20));

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
(sqlite3.OperationalError) table yeni_tablo already exists
[SQL: CREATE TABLE yeni_tablo(firstname varchar(20),
                        lastname varchar(20));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [9]:
%%sql
INSERT INTO yeni_tablo VALUES ('Ali','Uzak');

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
1 rows affected.

[]

In [10]:
%%sql 
SELECT * FROM yeni_tablo;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Mehmet', 'Şenel'),
 ('Berke', 'Özer'),
 ('Ali', 'Uzak'),
 ('Ahmet', 'Canlı'),
 ('Ali', 'Uzak')]

In [11]:
%%sql
INSERT INTO yeni_tablo VALUES ('Ahmet','Canlı');

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
1 rows affected.

[]

SELECT İşlemleri 

- select: seçim anlamı taşır ve veri tabanından çağırma işlemleri için sıkça kullanırız

In [12]:
%%sql
SELECT * FROM  Products LIMIT 10 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(1, 'Chais', 1, 1, '10 boxes x 20 bags', 18),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21),
 (6, "Grandma's Boysenberry Spread", 3, 2, '12 - 8 oz jars', 25),
 (7, "Uncle Bob's Organic Dried Pears", 3, 7, '12 - 1 lb pkgs.', 30),
 (8, 'Northwoods Cranberry Sauce', 3, 2, '12 - 12 oz jars', 40),
 (9, 'Mishi Kobe Niku', 4, 6, '18 - 500 g pkgs.', 97),
 (10, 'Ikura', 4, 8, '12 - 200 ml jars', 31)]

In [13]:
""" 
from = dan anlamı taşır ve veritabanı da yer alan hangi veriyi ya da satır,sutünü 
çekeceğimizi seçmemize yarar
limit : sınırlama ksııtlma seçme özelliği taşır
"""

' \nfrom = dan anlamı taşır ve veritabanı da yer alan hangi veriyi ya da satır,sutünü \nçekeceğimizi seçmemize yarar\nlimit : sınırlama ksııtlma seçme özelliği taşır\n'

In [14]:

%%sql
SELECT name FROM sqlite_master WHERE type = 'table' ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Products',),
 ('Customers',),
 ('Employees',),
 ('OrderDetails',),
 ('Orders',),
 ('Shippers',),
 ('Suppliers',),
 ('Categories',),
 ('yeni_tablo',)]

In [15]:
%%sql
SELECT * FROM  Customers where 1=0;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[]

In [16]:
%%sql
SELECT  CustomerName ,City , Country FROM Customers LIMIT 10;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[('Alfreds Futterkiste', 'Berlin', 'Germany'),
 ('Ana Trujillo Emparedados y helados', 'México D.F.', 'Mexico'),
 ('Antonio Moreno Taquería', 'México D.F.', 'Mexico'),
 ('Around the Horn', 'London', 'UK'),
 ('Berglunds snabbköp', 'Luleå', 'Sweden'),
 ('Blauer See Delikatessen', 'Mannheim', 'Germany'),
 ('Blondel père et fils', 'Strasbourg', 'France'),
 ('Bólido Comidas preparadas', 'Madrid', 'Spain'),
 ("Bon app'", 'Marseille', 'France'),
 ('Bottom-Dollar Marketse', 'Tsawassen', 'Canada')]

In [17]:
%%sql
SELECT Price , Price*3, Price*3-100 FROM Products LIMIT 8;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(18, 54, -46),
 (19, 57, -43),
 (10, 30, -70),
 (22, 66, -34),
 (21, 63, -37),
 (25, 75, -25),
 (30, 90, -10),
 (40, 120, 20)]

- * -> all anlamı taşır ve yıldız yerine özellikle çağrımak istediğimiz başlıkalr içerikler yazılabilir
- matematiksel işlemler olduğu gibi yazılarak kullanılabilir.
- AS fonksiyonu ile oluşturulan yeni sütunlar isimlendirilir ve kaydedilebilir.

In [18]:
%%sql
SELECT Price AS ilk_price , Price*3 AS yeni_price, Price*3-100 AS işlemli_price FROM Products LIMIT 10 ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(18, 54, -46),
 (19, 57, -43),
 (10, 30, -70),
 (22, 66, -34),
 (21, 63, -37),
 (25, 75, -25),
 (30, 90, -10),
 (40, 120, 20),
 (97, 291, 191),
 (31, 93, -7)]

In [19]:
%%sql 
SELECT COUNT (*) AS satir_sayisi FROM Products;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(77,)]

In [20]:
%%sql 
SELECT * FROM Products ORDER BY Price LIMIT 10;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(13, 'Konbu', 6, 8, '2 kg box', 6),
 (52, 'Filo Mix', 24, 5, '16 - 2 kg boxes', 7),
 (23, 'Tunnbröd', 9, 5, '12 - 250 g pkgs.', 9),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10),
 (21, "Sir Rodney's Scones", 8, 3, '24 pkgs. x 4 pieces', 10),
 (74, 'Longlife Tofu', 4, 7, '5 kg pkg.', 10),
 (46, 'Spegesild', 21, 8, '4 - 450 g glasses', 12),
 (58, 'Escargots de Bourgogne', 27, 8, '24 pieces', 13),
 (77, 'Original Frankfurter grüne Soße', 12, 2, '12 boxes', 13),
 (25, 'NuNuCa Nuß-Nougat-Creme', 11, 3, '20 - 450 g glasses', 14)]

- sayma işlemleri için "count" ifadesi kullanılır.
- sıralama işlemleri için "order by " ifadesi yer alır bu ifade küçükten büyüğe sıralar,
tam tersi için "order by desc" ifadesi kullanılır.

WHERE KOMUTU

- filtreleme işlemleri için kullanılan bir araçtır.
- birçok filtreleme türü bulunur ve veri içerisinde bulmak istediğimiz değeri ya da veriye erişmemize yardımcı olur.

In [21]:
%%sql
SELECT * FROM Customers WHERE Country = 'Sweden'

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (24, 'Folk och fä HB', 'Maria Larsson', 'Åkergatan 24', 'Bräcke', 'S-844 67', 'Sweden')]

In [24]:
%%sql
SELECT * FROM Customers WHERE PostalCode >'5021' ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (6, 'Blauer See Delikatessen', 'Hanna Moos', 'Forsterstr. 57', 'Mannheim', '68306', 'Germany'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France'),
 (10, 'Bottom-Dollar Marketse', 'Elizabeth Lincoln', '23 Tsawassen Blvd.', 'Tsawassen', 'T2F 8M4', 'Canada'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (13, 'Centro comercial Moctezuma', 'Francisco Chang', 'Sierras de Granada 9993', 'México D.F.', '5022', 'Mexico'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (17, 'Drachenblut Delikatessend', 'Sven Ottlieb', 'Walserweg 21', 'Aachen', '52066', 'Germany'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (20, 'Ernst Handel', 'Roland Mendel', 'Kirchgasse 6', 'Graz', '8010', 'Austria'),
 (23, 'Folies gourmandes', 'Martine Rancé', '184, chaussée de Tournai', 'Lille', '59000', 'France'),
 (24, 'Folk och fä HB', 'Maria Larsson', 'Åkergatan 24', 'Bräcke', 'S-844 67', 'Sweden'),
 (25, 'Frankenversand', 'Peter Franken', 'Berliner Platz 43', 'München', '80805', 'Germany'),
 (29, 'Galería del gastrónomo', 'Eduardo Saavedra', 'Rambla de Cataluña, 23', 'Barcelona', '8022', 'Spain'),
 (32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (35, 'HILARIÓN-Abastos', 'Carlos Hernández', 'Carrera 22 con Ave. Carlos Soublette #8-35', 'San Cristóbal', '5022', 'Venezuela'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (38, 'Island Trading', 'Helen Bennett', 'Garden House Crowther Way', 'Cowes', 'PO31 7PJ', 'UK'),
 (40, "La corne d'abondance", 'Daniel Tonini', "67, avenue de l'Europe", 'Versailles', '78000', 'France'),
 (42, 'Laughing Bacchus Wine Cellars', 'Yoshi Tannamuri', '1900 Oak St.', 'Vancouver', 'V3F 2K1', 'Canada'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (44, 'Lehmanns Marktstand', 'Renate Messner', 'Magazinweg 7', 'Frankfurt a.M.', '60528', 'Germany'),
 (45, "Let's Stop N Shop", 'Jaime Yorres', '87 Polk St. Suite 5', 'San Francisco', '94117', 'USA'),
 (48, 'Lonesome Pine Restaurant', 'Fran Wilson', '89 Chiaroscuro Rd.', 'Portland', '97219', 'USA'),
 (50, 'Maison Dewey', 'Catherine Dewey', 'Rue Joseph-Bens 532', 'Bruxelles', 'B-1180', 'Belgium'),
 (51, 'Mère Paillarde', 'Jean Fresnière', '43 rue St. Laurent', 'Montréal', 'H1J 1C3', 'Canada'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA'),
 (56, 'Ottilies Käseladen', 'Henriette Pfalzheim', 'Mehrheimerstr. 369', 'Köln', '50739', 'Germany'),
 (57, 'Paris spécialités', 'Marie Bertrand', '265, boulevard Charonne', 'Paris', '75012', 'France'),
 (58, 'Pericles Comidas clásicas', 'Guillermo Fernández', 'Calle Dr. Jorge Cash 321', 'México D.F.', '5033', 'Mexico'),
 (65, 'Rattlesnake Canyon Grocery', 'Paula Wilson', '2817 Milton Dr.', 'Albuquerque', '87110', 'USA'),
 (71, 'Save-a-lot Markets', 'Jose Pavarotti', '187 Suffolk Ln.', 'Boise', '83720', 'USA'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK'),
 (74, 'Spécialités du monde', 'Dominique Perrier', '25, rue Lauriston', 'Paris', '75016', 'France'),
 (75, 'Split Rail Beer & Ale', 'Art Braunschweiger', 'P.O. Box 555', 'Lander', '82520', 'USA'),
 (76, 'Suprêmes délices', 'Pascale Cartrain', 'Boulevard Tirou, 255', 'Charleroi', 'B-6000', 'Belgium'),
 (77, 'The Big Cheese', 'Liz Nixon', '89 Jefferson Way Suite 2', 'Portland', '97201', 'USA'),
 (78, 'The Cracker Box', 'Liu Wong', '55 Grizzly Peak Rd.', 'Butte', '59801', 'USA'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico'),
 (82, "Trail's Head Gourmet Provisioners", 'Helvetius Nagy', '722 DaVinci Blvd.', 'Kirkland', '98034', 'USA'),
 (83, 'Vaffeljernet', 'Palle Ibsen', 'Smagsløget 45', 'Århus', '8200', 'Denmark'),
 (84, 'Victuailles en stock', 'Mary Saveley', '2, rue du Commerce', 'Lyon', '69004', 'France'),
 (85, 'Vins et alcools Chevalier', 'Paul Henriot', "59 rue de l'Abbaye", 'Reims', '51100', 'France'),
 (86, 'Die Wandernde Kuh', 'Rita Müller', 'Adenauerallee 900', 'Stuttgart', '70563', 'Germany'),
 (87, 'Wartian Herkku', 'Pirkko Koskitalo', 'Torikatu 38', 'Oulu', '90110', 'Finland'),
 (89, 'White Clover Markets', 'Karl Jablonski', '305 - 14th Ave. S. Suite 3B', 'Seattle', '98128', 'USA')]

In [25]:
%%sql
SELECT * FROM Customers WHERE Country = 'UK' AND City = 'London' ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (11, "B's Beverages", 'Victoria Ashworth', 'Fauntleroy Circus', 'London', 'EC2 5NT', 'UK'),
 (16, 'Consolidated Holdings', 'Elizabeth Brown', 'Berkeley Gardens 12 Brewery', 'London', 'WX1 6LT', 'UK'),
 (19, 'Eastern Connection', 'Ann Devon', '35 King George', 'London', 'WX3 6FW', 'UK'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK')]

In [26]:
%%sql
SELECT * FROM Customers WHERE Country = 'USA' AND (City = 'Eugene' OR City = 'Elgin');

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(32, 'Great Lakes Food Market', 'Howard Snyder', '2732 Baker Blvd.', 'Eugene', '97403', 'USA'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA')]

- Where komutu içerisinde and , or, in,not in gibi ekstra komutlara yer vermek mümkündür.
- and : birden çok seçimi aynı kümede bulunan kesişimlerini alır.
- or : birden çok seçimin birleşimlerini tek bir kümede toplar.
- in , no in : tek tek or kullanmak yerine tek bir parantezde birden çok birleşim kümesi oluşturmaya yarar.

In [27]:
%%sql
SELECT * FROM Customers WHERE  CustomerID in (1,3,5,7);

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(1, 'Alfreds Futterkiste', 'Maria Anders', 'Obere Str. 57', 'Berlin', '12209', 'Germany'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (5, 'Berglunds snabbköp', 'Christina Berglund', 'Berguvsvägen 8', 'Luleå', 'S-958 22', 'Sweden'),
 (7, 'Blondel père et fils', 'Frédérique Citeaux', '24, place Kléber', 'Strasbourg', '67000', 'France')]

LIKE İşlemleri 

- a% : a ile başlayan değerler
- %a : a ile biten değerler
- %or% : herhangi bir yerinde or olan değerler
- _r% : ikinci sırasında r olan değerler
- a%% : a ile başlayıp en az 3 karakter olan değerler
- a%o : a ile başlayıp o ile biten değerler

In [28]:
%%sql
SELECT * FROM  Customers WHERE CustomerName LIKE '%or%' LIMIT 15;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico'),
 (4, 'Around the Horn', 'Thomas Hardy', '120 Hanover Sq.', 'London', 'WA1 1DP', 'UK'),
 (36, 'Hungry Coyote Import Store', 'Yoshi Latimer', 'City Center Plaza 516 Main St.', 'Elgin', '97827', 'USA'),
 (40, "La corne d'abondance", 'Daniel Tonini', "67, avenue de l'Europe", 'Versailles', '78000', 'France'),
 (43, 'Lazy K Kountry Store', 'John Steel', '12 Orchestra Terrace', 'Walla Walla', '99362', 'USA'),
 (52, 'Morgenstern Gesundkost', 'Alexander Feuer', 'Heerstr. 22', 'Leipzig', '4179', 'Germany'),
 (53, 'North/South', 'Simon Crowther', 'South House 300 Queensbridge', 'London', 'SW7 1RZ', 'UK'),
 (55, 'Old World Delicatessen', 'Rene Phillips', '2743 Bering St.', 'Anchorage', '99508', 'USA'),
 (72, 'Seven Seas Imports', 'Hari Kumar', '90 Wadhurst Rd.', 'London', 'OX15 4NB', 'UK'),
 (80, 'Tortuga Restaurante', 'Miguel Angel Paolino', 'Avda. Azteca 123', 'México D.F.', '5033', 'Mexico'),
 (88, 'Wellington Importadora', 'Paula Parente', 'Rua do Mercado, 12', 'Resende', '08737-363', 'Brazil')]

In [31]:
%%sql
SELECT * FROM  Customers WHERE CustomerName LIKE  'a%' AND Country LIKE '%o' ;

 * sqlite:////Users/mehmetsenel/Desktop/SQL-JUPİTER/vbo.db
Done.

[(2, 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Avda. de la Constitución 2222', 'México D.F.', '5021', 'Mexico'),
 (3, 'Antonio Moreno Taquería', 'Antonio Moreno', 'Mataderos 2312', 'México D.F.', '5023', 'Mexico')]